Tekla Open API Reference for Tekla Structures 2025
Line.Direction Property
 The direction vector of the line.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Direction { get; set; }
Public Property Direction As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
Line Class
Tekla.Structures.Geometry3d Namespace